<a href="https://colab.research.google.com/github/HwangHanJae/BigDataPratice/blob/main/13_week.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#작업형1

데이터 출처 :https://www.data.go.kr/data/15051872/fileData.do(참고, 데이터 수정)

데이터 설명 : 서울특별시_공공자전거 시간대별 이용정보

​

data url = https://raw.githubusercontent.com/Datamanim/datarepo/main/bicycle/seoul_bi.csv

In [ ]:

import pandas as pd

df = pd.read_csv("https://raw.githubusercontent.com/Datamanim/datarepo/main/bicycle/seoul_bi.csv")

df.head()

         대여일자  대여시간  대여소번호 대여구분코드 성별 연령대코드  이용건수    운동량   탄소량     이동거리  사용시간
0  2021-06-01     0   3541    정기권  F  ~10대     1   0.00  0.00     0.00     8
1  2021-06-01     0    765    정기권  F  ~10대     1  27.21  0.35  1526.81    19
2  2021-06-01     0   2637    정기권  F  ~10대     1  41.40  0.37  1608.56    18
3  2021-06-01     0   2919    정기권  F  ~10대     1   0.00  0.00     0.00    75
4  2021-06-01     0    549    정기권  F  ~10대     1  13.04  0.17   731.55     6

##Q1.  대여일자별 데이터의 수를 데이터프레임으로 출력하고, 

##가장 많은 데이터가 있는 날짜를 출력하라

In [ ]:
df.groupby(["대여일자"]).size().sort_values(ascending=False).head(1).to_frame().index[0]

'2021-06-04'

In [ ]:
#Answer

result = df["대여일자"].value_counts().sort_values().to_frame()
answer = result.loc[result["대여일자"] == result["대여일자"].max()].index[0]

display(result)
print(answer)

             대여일자
2021-06-03  18985
2021-06-10  36992
2021-06-13  43131
2021-06-06  47787
2021-06-01  48081
2021-06-12  48569
2021-06-11  52089
2021-06-07  52623
2021-06-05  52730
2021-06-09  54507
2021-06-14  54945
2021-06-08  55623
2021-06-02  56100
2021-06-04  56788

2021-06-04

##Q2. 각 일자의 요일을 표기하고 ('Monday' ~'Sunday') 'day_name'컬럼을 추가하고

##이를 이용하여 각 요일별 이용 횟수의 총합을 데이터 프레임으로 출력하라

In [ ]:
df["day_name"] = pd.to_datetime(df["대여일자"]).dt.day_name()
df.groupby(["day_name"]).size().sort_values(ascending=False).to_frame()

                0
day_name
Wednesday  110607
Friday     108877
Monday     107568
Tuesday    103704
Saturday   101299
Sunday      90918
Thursday    55977

In [ ]:
#Answer
df["day_name"] = pd.to_datetime(df["대여일자"]).dt.day_name()
df["day_name"].value_counts().to_frame()

           day_name
Wednesday    110607
Friday       108877
Monday       107568
Tuesday      103704
Saturday     101299
Sunday        90918
Thursday      55977

##Q3. 각 요일별 가장 많이 이용한 대여소의 이용횟수와 대여소 번호를 데이터 프레임으로 출력하라

In [ ]:
#각 요일별 가장 많이 이용한 대여소의 이용횟수
result = df.groupby(["day_name","대여소번호"]).size().to_frame("size").sort_values(by=["day_name","size"],ascending=False).reset_index()


answer = result.drop_duplicates("day_name", keep="first").reset_index(drop=True)
print(answer)

    day_name  대여소번호  size
0  Wednesday    502   282
1    Tuesday    502   267
2   Thursday   2715   137
3     Sunday    502   372
4   Saturday    502   378
5     Monday    502   242
6     Friday    502   277

##Q4. 나이대별 대여구분 코드의 (일일권/전체횟수) 비율을 구한 후 

##가장 높은 비율을 가지는 나이대를 확인하라. 일일권의 경우 일일권 과 일일권(비회원)을 모두 포함하라

In [ ]:
df["대여구분코드"].unique()

array(['정기권', '일일권', '단체권', '일일권(비회원)'], dtype=object)

In [ ]:
daily = df.loc[df["대여구분코드"].isin(["일일권","일일권(비회원)"])]["연령대코드"].value_counts().sort_index()
total = df["연령대코드"].value_counts().sort_index()
answer = (daily / total).sort_values(ascending=False)
answer

~10대    0.312525
20대     0.239913
30대     0.166702
40대     0.110585
50대     0.065414
70대~    0.048962
60대     0.042462
Name: 연령대코드, dtype: float64

##Q5. 연령대별 평균 이동거리를 구하여라

In [ ]:
answer = df.groupby(["연령대코드"])["이동거리"].mean().to_frame()
answer

              이동거리
연령대코드
20대    3211.890552
30대    3341.443859
40대    3514.857416
50대    3593.668100
60대    3538.145737
70대~   3085.039641
~10대   2634.426279

##Q6. 연령대 코드가 20대인 데이터를 추출하고, 

##이동거리값이 추출한 데이터의 이동거리값의 평균 이상인 데이터를 추출한다

##최종 추출된 데이터를 대여일자, 대여소 번호 순서로 내림차순 정렬 후 

##1행부터 200행까지의 탄소량의 평균을 소숫점 3째 자리까지 구하여라

In [ ]:
#연령대코드 20대 데이터 추출
df_20 = df.loc[df["연령대코드"] == "20대"]
#이동거리값이 추출한 데이터의 이동거리값의 평균 이상인 데이터를 추출
target = df_20.loc[df["이동거리"] >= df_20["이동거리"].mean()]
#최종 추출된 데이터를 대여일자, 대여소 번호 순서로 내림차순 정렬 후
target = target.sort_values(by=["대여일자","대여소번호"], ascending=False)
#1행부터 200행까지의 탄소량의 평균을 소숫점 3째자리까지
import numpy as np
np.round(target[0:200]["탄소량"].astype(float).mean(),3)

1.613

In [ ]:
#Answer
#연령대코드 20대 데이터 추출
tw = df[df["연령대코드"] == "20대"].reset_index(drop=True)
#이동거리값이 추출한 데이터의 이동거리값의 평균 이상인 데이터를 추출
tw_mean = tw[tw["이동거리"] >= tw["이동거리"].mean()]
#최종 추출된 데이터를 대여일자, 대여소 번호 순서로 내림차순 정렬 후
tw_mean["탄소량"] = tw_mean["탄소량"].astype(float)
target = tw_mean.sort_values(["대여일자","대여소번호"], ascending=False).reset_index(drop=True)
#1행부터 200행까지의 탄소량의 평균을 소숫점 3째자리까지
answer = round(target[0:200]["탄소량"].mean(),3)
print(answer)

1.613

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:7: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  import sys

##Q7. 6월 7일 ~10대의 "이용건수"의 중앙값은?

In [ ]:
answer = df.loc[(pd.to_datetime(df["대여일자"]) == pd.to_datetime("2021/06/07")) & (df["연령대코드"] == "~10대")]["이용건수"].median()

print(answer)

1.0

In [ ]:
#Answer
df["대여일자"] = pd.to_datetime(df["대여일자"])
result = df.loc[(df["연령대코드"] == "~10대") & (df["대여일자"] == pd.to_datetime("2021-06-07"))]["이용건수"]
answer = result.median()

print(answer)

1.0

##Q8. 평일 (월~금) 출근 시간대(오전 6,7,8시)의 대여소별 

##이용 횟수를 구해서 데이터 프레임 형태로 표현한 후

##각 대여시간별 이용 횟수의 상위 3개 대여소와 이용횟수를 출력하라

In [ ]:
df["대여시간"].unique()

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16,
       17, 18, 19, 20, 21, 22, 23])

In [ ]:
df["day_of_week"] = df["대여일자"].dt.dayofweek
#평일(월~금) 출근 시간대(오전 6,7,8)
target = df.loc[(df["day_of_week"] < 5)  & (df["대여시간"].isin([6,7,8]))]
#대여소별 이용횟수를 구하여 데이터 프레임 형태로 표현
result = target.groupby(["대여시간","대여소번호"]).size().to_frame("이용횟수")
#각 대여시간별 이용횟수의 상위 3개 대여소와 이용횟수를 출력
answer = result.sort_values(["대여시간","이용횟수"], ascending=False).groupby(["대여시간"]).head(3)

answer

            이용횟수
대여시간 대여소번호
8    2701    119
     646     115
     1152     92
7    259     104
     230      77
     726      77
6    2744     45
     1125     40
     1028     36

##Q9. 이동거리의 평균 이상의 이동거리 값을 가지는 데이터를 추출하여 

##추출데이터의 이동거리의 표본표준편차 값을 구하여라

In [244]:
import numpy as np
#이동거리의 평균 이상의 이동거리 값을 가지는 데이터 추출
target = df[df["이동거리"] >= df["이동거리"].mean()]
#표준편차
answer = target["이동거리"].std()

print(answer)

5092.139707505305

##Q10. 남성('M' or 'm')과 여성('F' or 'f')의 이동거리값의 평균값을 구하여라

In [256]:
df["성별"].unique()

def check(x):
  if x == "M" or x == "m":
    return "M"
  elif x == "F" or x == "f":
    return "F"

df["성별"] = df["성별"].apply(check)
answer = df[["성별","이동거리"]].groupby(["성별"]).mean()
answer

           이동거리
성별
F   3468.575025
M   3209.110871